
  # Ultralytics YOLO , AGPL-3.0 license
  # RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

  # Parameters
  nc: 80  # number of classes
  scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
    # [depth, width, max_channels]
    l: [1.00, 1.00, 1024]

  backbone:
    # [from, repeats, module, args]
    - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
    - [-1, 6, HGBlock, [48, 128, 3]]  # 1

    - [-1, 1, DWConv, [128, 3, 2, 1, False]]
    - [-1, 6, HGBlock, [96, 512, 3]]

    - [-1, 1, Conv, [256, 1, 1]]
    - [-2, 1, Conv, [256, 1, 1]]
    - [-1, 1, Conv, [256, 3, 1]]
    - [-1, 1, ScConv, [256]]
    - [-1, 1, Conv, [256, 3, 1]]
    - [-1, 1, ScConv, [256]]
    - [[-1, -3, -5, -6], 1, Concat, [1]]
    - [-1, 1, Conv, [512, 1, 1]]

    - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 12
    - [-1, 6, HGBlock, [192, 1024, 5, True, False]]  # 13
    - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
    - [-1, 6, HGBlock, [192, 1024, 5, True, True]]# 15

    - [-1, 1, Conv, [512, 1, 1]]
    - [-2, 1, Conv, [512, 1, 1]]
    - [-1, 1, Conv, [512, 3, 1]]
    - [-1, 1, ScConv, [512]]
    - [-1, 1, Conv, [512, 3, 1]]
    - [-1, 1, ScConv, [512]]
    - [[-1, -3, -5, -6], 1, Concat, [1]]
    - [-1, 1, Conv, [1024, 1, 1]]

    - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 24
    - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # stage 4
    - [-1, 1, Conv, [1024, 1, 1]]
    - [-2, 1, Conv, [1024, 1, 1]]
    - [-1, 1, DWConv, [1024, 3, 1]]
    - [-1, 1, ScConv, [1024]]
    - [-1, 1, DWConv, [1024, 3, 1]]
    - [-1, 1, ScConv, [1024]]
    - [[-1, -3, -5, -6], 1, Concat, [1]]
    - [-1, 1, Conv, [2048, 1, 1]]


  head:
    - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 34
    - [-1, 1, AIFI, [1024, 8]]
    - [-1, 1, Conv, [256, 1, 1]]

    - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
    - [15, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 38
    - [[-2, -1], 1, Concat, [1]]
    - [-1, 3, RepC3, [256]]  # 40
    - [-1, 1, Conv, [256, 1, 1]]   # 41

    - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
    - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 43
    - [[-2, -1], 1, Concat, [1]]  # 44
    - [-1, 3, RepC3, [256]]    # X3 (21), fpn_blocks.1

    - [-1, 1, Conv, [256, 3, 2]]   # 46, downsample_convs.0
    - [[-1, 41], 1, Concat, [1]]  # cat Y4
    - [-1, 3, RepC3, [256]]    # 48

    - [-1, 1, Conv, [256, 3, 2]]   # 49, downsample_convs.1
    - [[-1, 36], 1, Concat, [1]]  # cat Y5
    - [-1, 3, RepC3, [256]]    # F5 (27), pan_blocks.1
    - [45, 1, ScConv, [256]]
    - [48, 1, ScConv, [256]]
    - [51, 1, ScConv, [256]]

    - [[52, 53, 54], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)