
  # Ultralytics YOLO , AGPL-3.0 license
  # RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

  # Parameters
  nc: 80  # number of classes
  scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
    # [depth, width, max_channels]
    l: [1.00, 1.00, 1024]

  backbone:
    # [from, repeats, module, args]
    - [-1, 1, HGStem1, [32, 48]]  # 0-P2/4
    - [-1, 1, Conv, [48, 1, 1]]
    - [-2, 1, Conv, [48, 1, 1]]
    - [-1, 1, Conv, [48, 3, 1]]
    - [-1, 1, Conv, [48, 3, 1]]
    - [-1, 1, Conv, [48, 3, 1]]
    - [-1, 1, ScConv, [48]]
    - [[-1, -3, -5, -6], 1, Concat, [1]]
    - [-1, 1, Conv, [48, 1, 1]]
    - [-1, 6, HGBlock1, [48, 128, 3]]  # 9

    - [-1, 1, DWConv, [128, 3, 2, 1, False]]
    - [-1, 6, HGBlock1, [96, 512, 3]]

    - [-1, 1, Conv, [256, 1, 1]]
    - [-2, 1, Conv, [256, 1, 1]]
    - [-1, 1, Conv, [256, 3, 1]]
    - [-1, 1, ScConv, [256]]
    - [-1, 1, Conv, [256, 3, 1]]
    - [-1, 1, ScConv, [256]]
    - [[-1, -3, -5, -6], 1, Concat, [1]]
    - [-1, 1, Conv, [512, 1, 1]]

    - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 20
    - [-1, 6, HGBlock1, [192, 1024, 5, True, False]]  # 21
    - [-1, 6, HGBlock1, [192, 1024, 5, True, True]]
    - [-1, 6, HGBlock1, [192, 1024, 5, True, True]]# 23

    - [-1, 1, Conv, [512, 1, 1]]
    - [-2, 1, Conv, [512, 1, 1]]
    - [-1, 1, DWConv, [512, 3, 1]]
    - [-1, 1, ScConv, [512]]
    - [-1, 1, DWConv, [512, 3, 1]]
    - [-1, 1, ScConv, [512]]
    - [[-1, -3, -5, -6], 1, Concat, [1]]
    - [-1, 1, Conv, [1024, 1, 1]]

    - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 32
    - [-1, 6, HGBlock1, [384, 2048, 5, True, False]]  # stage 4


  head:
    - [-1, 1, dtmamba2, [512, 1024]]
    - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 35
    - [-1, 1, AIFI, [1024, 8]]
    - [-1, 1, Conv, [256, 1, 1]]

    - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
    - [31, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 39
    - [[-2, -1], 1, Concat, [1]]
    - [-1, 3, RepC3, [256]]  # 41
    - [-1, 1, Conv, [256, 1, 1]]   # 42

    - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
    - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 44
    - [[-2, -1], 1, Concat, [1]]  # 45
    - [-1, 3, RepC3, [256]]    # X3 (21), fpn_blocks.1

    - [-1, 1, Conv, [256, 3, 2]]   # 47
    - [[-1, 42], 1, Concat, [1]]  # cat Y4
    - [-1, 3, RepC3, [256]]    # 49

    - [-1, 1, Conv, [256, 3, 2]]
    - [[-1, 37], 1, Concat, [1]]
    - [-1, 3, RepC3, [256]]    # 52
    - [46, 1, ScConv, [256]]
    - [49, 1, ScConv, [256]]
    - [52, 1, ScConv, [256]]

    - [[53, 54, 55], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)